03_fundamentos_avancados_de_ruby/aula_05/app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks" WHERE (title LIKE '%'Task'%')
SELECT "tasks".* FROM "tasks"
---
  def index
    @tasks = Task.all

    @tasks = @tasks.send(params[:status]) if params[:status].present?
    @tasks = @tasks.where("title LIKE ?", "%" + Task.sanitize_sql_like(params[:title]) + "%") if params[:title].present?
    @tasks = @tasks.where("description LIKE ?", "%" + Task.sanitize_sql_like(params[:description]) + "%") if params[:description].present?

INSERT INTO "tasks" ("title", "description", "status", "created_at", "updated_at") VALUES ('Task 1', 'Descrição da task', 0, '2025-07-11 01:54:27.180253', '2025-07-11 01:54:27.180253') RETURNING "id"
---
  def create
    @task = Task.new(task_params)
    if @task.save

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = 1 LIMIT 1
UPDATE "tasks" SET "status" = 3, "updated_at" = '2025-07-11 02:06:19.843440' WHERE "tasks"."id" = 1
---
  def update
    @task = Task.find(params[:id])
    if @task.update(task_params)

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = 1 LIMIT 1
UPDATE "tasks" SET "status" = 3, "updated_at" = '2025-07-11 02:06:19.843440' WHERE "tasks"."id" = 1
---
  def destroy
    @task = Task.find(params[:id])
    if @task.update(status: "canceled")